{
  "0001045810-25-000230": "Risk Factors 33 Item 2. Unregistered Sales of Equity Securities and Use of Proceeds 41 Item 5. Other Information 42 Item 6. Exhibits 43 Signature 44 Where You Can Find More Information Investors and others should note that we announce material financial information to our investors using our investor relations website, press releases, SEC filings and public conference calls and webcasts. We also use the following social media channels as a means of disclosing information about the company, our products, our planned financial and other announcements and attendance at upcoming investor and industry conferences, and other matters, and for complying with our disclosure obligations under Regulation FD: NVIDIA Corporate Blog (http://blogs.nvidia.com) NVIDIA Technical Blog (http://developer.nvidia.com/blog/) NVIDIA LinkedIn Page (http://www.linkedin.com/company/nvidia) NVIDIA Facebook Page (https://www.facebook.com/nvidia) NVIDIA Instagram Page (https://www.instagram.com/nvidia) NVIDIA X Account (https://x.com/nvidia) NVIDIA Threads Page (https://www.threads.com/@nvidia) NVIDIA Investor Relations Page (https://investor.nvidia.com) In addition, investors and others can view NVIDIA videos on YouTube (https://www.YouTube.com/nvidia). The information we post through these social media channels may be deemed material. Accordingly, investors should monitor these accounts and the blog, in addition to following our press releases, SEC filings and public conference calls and webcasts. This list may be updated from time to time. The information we post through these channels is not a part of this Quarterly Report on Form 10-Q. These channels may be updated from time to time on NVIDIA's investor relations website. 2 Part I. Financial Information Item 1. Financial Statements (Unaudited) NVIDIA Corporation and Subsidiaries Condensed Consolidated Statements of Income (In millions, except per share data) (Unaudited) Three Months Ended Nine Months Ended Oct 26, 2025 Oct 27, 2024 Oct 26, 2025 Oct 27, 2024 Revenue $ 57,006 $ 35,082 $ 147,811 $ 91,166 Cost of revenue 15,157 8,926 45,441 22,031 Gross profit 41,849 26,156 102,370 69,135 Operating expenses Research and development 4,705 3,390 12,985 9,200 Sales, general and administrative 1,134 897 3,297 2,516 Total operating expenses 5,839 4,287 16,282 11,716 Operating income 36,010 21,869 86,088 57,419 Interest income 624 472 1,732 1,275 Interest expense ( 61 ) ( 61 ) ( 186 ) ( 186 ) Other income, net 1,363 36 3,418 301 Total other income, net 1,926 447 4,964 1,390 Income before income tax 37,936 22,316 91,052 58,809 Income tax expense 6,026 3,007 13,945 8,020 Net income $ 31,910 $ 19,309 $ 77,107 $ 50,789 Net income per share: Basic $ 1.31 $ 0.79 $ 3.16 $ 2.07 Diluted $ 1.30 $ 0.78 $ 3.14 $ 2.04 Weighted average shares used in per share computation: Basic 24,327 24,533 24,378 24,577 Diluted 24,483 24,774 24,542 24,837 See accompanying Notes to Condensed Consolidated Financial Statements. 3 NVIDIA Corporation and Subsidiaries Condensed Consolidated Statements of Comprehensive Income (In millions) (Unaudited) Three Months Ended Nine Months Ended Oct 26, 2025 Oct 27, 2024 Oct 26, 2025 Oct 27, 2024 Net income $ 31,910 $ 19,309 $ 77,107 $ 50,789 Other comprehensive income, net of tax Available-for-sale securities: Net change in unrealized gain 184 49 270 71 Cash flow hedges: Change in unrealized gain (loss) ( 28 ) — 27 20 Reclassification adjustments for net realized gain (loss) included in net income 13 ( 2 ) 14 ( 15 ) Net change in unrealized gain (loss) ( 15 ) ( 2 ) 41 5 Other comprehensive income, net of tax 169 47 311 76 Total comprehensive income $ 32,079 $ 19,356 $ 77,418 $ 50,865 See accompanying Notes to Condensed Consolidated Financial Statements. 4 NVIDIA Corporation and Subsidiaries Condensed Consolidated Balance Sheets (In millions) (Unaudited) Oct 26, 2025 Jan 26, 2025 Assets Current assets: Cash and cash equivalents $ 11,486 $ 8,589 Marketable securities 49,122 34,621 Accounts receivable, net 33,391 23,065 Inventories 19,784 10,080 Prepaid expenses and other current assets 2,709 3,771 Total current assets 116,492 80,126 Property and equipment, net 9,780 6,283 Operating lease assets 2,281 1,793 Goodwill 6,261 5,188 Intangible assets, net 936 807 Deferred income tax assets 13,674 10,979 Other assets 11,724 6,425 Total assets $ 161,148 $ 111,601 Liabilities and Shareholders' Equity Current liabilities: Accounts payable $ 8,624 $ 6,310 Accrued and other current liabilities 16,452 11,737 Short-term debt 999 — Total current liabilities 26,075 18,047 Long-term debt 7,468 8,463 Long-term operating lease liabilities 2,014 1,519 Other long-term liabilities 6,694 4,245 Total liabilities 42,251 32,274 Commitments and contingencies - see Note 11 Shareholders’ equity: Preferred stock — — Common stock 24 24 Additional paid-in capital 10,626 11,237 Accumulated other comprehensive income 339 28 Retained earnings 107,908 68,038 Total shareholders' equity 118,897 79,327 Total liabilities and shareholders' equity $ 161,148 $ 111,601 See accompanying Notes to Condensed Consolidated Financial Statements. 5 NVIDIA Corporation and Subsidiaries Condensed Consolidated Statements of Shareholders' Equity (Unaudited) Common Stock Outstanding Additional Paid-in Capital Accumulated Other Comprehensive Income Retained Earnings Total Shareholders' Equity Shares Amount (In millions, except per share data) Balances as of Jul 27, 2025 24,347 $ 24 $ 11,200 $ 170 $ 88,737 $ 100,131 Net income — — — — 31,910 31,910 Other comprehensive income — — — 169 — 169 Issuance of common stock 42 — 275 — — 275 Tax withholding related to common stock ( 14 ) — ( 2,429 ) — — ( 2,429 ) Shares repurchased ( 70 ) — ( 78 ) — ( 12,496 ) ( 12,574 ) Cash dividends declared and paid ($ 0.01 per common share) — — — — ( 243 ) ( 243 ) Fair value of partially vested equity awards assumed in connection with acquisitions — — 5 — — 5 Stock-based compensation — — 1,653 — — 1,653 Balances as of Oct 26, 2025 24,305 $ 24 $ 10,626 $ 339 $ 107,908 $ 118,897 Balances as of Jul 28, 2024 24,562 $ 25 $ 12,115 $ 56 $ 45,961 $ 58,157 Net income — — — — 19,309 19,309 Other comprehensive income — — — 47 — 47 Issuance of common stock 53 — 204 — — 204 Tax withholding related to common stock ( 15 ) — ( 1,680 ) — — ( 1,680 ) Shares repurchased ( 92 ) — ( 71 ) — ( 11,075 ) ( 11,146 ) Cash dividends declared and paid ($ 0.01 per common share) — — — — ( 245 ) ( 245 ) Stock-based compensation — — 1,253 — — 1,253 Balances as of Oct 27, 2024 24,508 $ 25 $ 11,821 $ 103 $ 53,950 $ 65,899 See accompanying Notes to Condensed Consolidated Financial Statements. 6 NVIDIA Corporation and Subsidiaries Condensed Consolidated Statements of Shareholders' Equity (Unaudited) Common Stock Outstanding Additional Paid-in Capital Accumulated Other Comprehensive Income Retained Earnings Total Shareholders' Equity Shares Amount (In millions, except per share data) Balances, Jan 26, 2025 24,477 $ 24 $ 11,237 $ 28 $ 68,038 $ 79,327 Net income — — — — 77,107 77,107 Other comprehensive income — — — 311 — 311 Issuance of common stock 129 — 643 — — 643 Tax withholding related to common stock ( 39 ) — ( 5,809 ) — — ( 5,809 ) Shares repurchased ( 262 ) — ( 228 ) — ( 36,505 ) ( 36,733 ) Cash dividends declared and paid ($ 0.03 per common share) — — — — ( 732 ) ( 732 ) Fair value of partially vested equity awards assumed in connection with acquisitions — — 28 — — 28 Stock-based compensation — — 4,755 — — 4,755 Balances as of Oct 26, 2025 24,305 $ 24 $ 10,626 $ 339 $ 107,908 $ 118,897 Balances, Jan 28, 2024 24,643 $ 25 $ 13,109 $ 27 $ 29,817 $ 42,978 Net income — — — — 50,789 50,789 Other comprehensive income — — — 76 — 76 Issuance of common stock 165 — 489 — — 489 Tax withholding related to common stock ( 46 ) — ( 5,068 ) — — ( 5,068 ) Shares repurchased ( 254 ) — ( 141 ) — ( 26,067 ) ( 26,208 ) Cash dividends declared and paid ($ 0.024 per common share) — — — — ( 589 ) ( 589 ) Stock-based compensation — — 3,432 — — 3,432 Balances as of Oct 27, 2024 24,508 $ 25 $ 11,821 $ 103 $ 53,950 $ 65,899 See accompanying Notes to Condensed Consolidated Financial Statements. 7 NVIDIA Corporation and Subsidiaries Condensed Consolidated Statements of Cash Flows (In millions) (Unaudited) Nine Months Ended Oct 26, 2025 Oct 27, 2024 Cash flows from operating activities: Net income $ 77,107 $ 50,789 Adjustments to reconcile net income to net cash provided by operating activities: Stock-based compensation expense 4,753 3,416 Depreciation and amortization 2,031 1,321 Deferred income taxes ( 2,035 ) ( 3,879 ) Gains on non-marketable equity securities and publicly-held equity securities, net ( 3,426 ) ( 302 ) Other ( 276 ) ( 365 ) Changes in operating assets and liabilities, net of acquisitions: Accounts receivable ( 10,325 ) ( 7,694 ) Inventories ( 9,703 ) ( 2,357 ) Prepaid expenses and other assets 857 ( 726 ) Accounts payable 2,032 2,490 Accrued and other current liabilities 4,204 3,918 Other long-term liabilities 1,311 849 Net cash provided by operating activities 66,530 47,460 Cash flows from investing activities: Proceeds from maturities of marketable securities 8,980 9,485 Proceeds from sales of marketable securities 487 318 Proceeds from sales of non-marketable equity securities 72 171 Purchases of marketable securities ( 20,076 ) ( 19,565 ) Purchases related to property and equipment and intangible assets ( 4,758 ) ( 2,159 ) Purchases of non-marketable equity securities ( 4,702 ) ( 1,008 ) Acquisitions, net of cash acquired ( 1,370 ) ( 465 ) Net cash used in investing activities ( 21,367 ) ( 13,223 ) Cash flows from financing activities: Proceeds related to employee stock plans 643 489 Payments related to repurchases of common stock ( 36,271 ) ( 25,895 ) Payments related to employee stock plan taxes ( 5,809 ) ( 5,068 ) Dividends paid ( 732 ) ( 589 ) Principal payments on property and equipment and intangible assets ( 97 ) ( 97 ) Repayment of debt — ( 1,250 ) Net cash used in financing activities ( 42,266 ) ( 32,410 ) Change in cash and cash equivalents 2,897 1,827 Cash and cash equivalents at beginning of period 8,589 7,280 Cash and cash equivalents at end of period $ 11,486 $ 9,107 Supplemental disclosure of cash flow information: Cash paid for income taxes, net $ 13,309 $ 10,989 See accompanying Notes to Condensed Consolidated Financial Statements. 8 NVIDIA Corporation and Subsidiaries Notes to Condensed Consolidated Financial Statements (Unaudited) Note 1 - Summary of Significant Accounting Policies Basis of Presentation The accompanying unaudited condensed consolidated financial statements were prepared in accordance with accounting principles generally accepted in the United States of America, or U.S. GAAP, for interim financial information and with the instructions to Form 10-Q and Article 10 of Securities and Exchange Commission, or SEC, Regulation S-X. The January 26, 2025 consolidated balance sheet was derived from our audited consolidated financial statements included in our Annual Report on Form 10-K for the fiscal year ended January 26, 2025, as filed with the SEC, but does not include all disclosures required by U.S. GAAP. In the opinion of management, all adjustments, consisting only of normal recurring adjustments considered necessary for a fair presentation of results of operations and financial position, have been included. The results for the interim periods presented are not necessarily indicative of the results expected for any future period. The following information should be read in conjunction with the audited consolidated financial statements and notes thereto included in our Annual Report on Form 10-K for the fiscal year ended January 26, 2025. Certain balances from the prior fiscal year have been reclassified to conform to the current period presentation. Significant Accounting Policies There have been no material changes to our significant accounting policies disclosed in Note 1 - Organization and Summary of Significant Accounting Policies, of the Notes to the Consolidated Financial Statements included in our Annual Report on Form 10-K for the fiscal year ended January 26, 2025. Fiscal Year Fiscal years 2026 and 2025 are both 52-week years ending on the last Sunday in January. The third quarters of fiscal years 2026 and 2025 were both 13-week quarters. Principles of Consolidation Our condensed consolidated financial statements include the accounts of NVIDIA Corporation and our wholly owned subsidiaries. All intercompany balances and transactions have been eliminated in consolidation. Use of Estimates The preparation of financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosures of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenue and expenses during the reporting period. Actual results could differ materially from our estimates. On an on-going basis, we evaluate our estimates, including those related to accounts receivable, cash equivalents and marketable securities, goodwill, income taxes, inventories and product purchase commitments, investigation and settlement costs, litigation, non-marketable equity securities, other contingencies, property, plant, and equipment, restructuring and other charges, revenue recognition, and stock-based compensation. These estimates are based on historical facts and various other assumptions that we believe are reasonable. Recently Issued Accounting Pronouncements Recent Accounting Pronouncements Not Yet Adopted In December 2023, the FASB issued a new accounting standard which includes new and updated income tax disclosures, including disaggregation of information in the rate reconciliation and income taxes paid. We are currently assessing the effect of the adoption of this standard on our disclosures that will be included in the fiscal year 2026 annual report. In November 2024, the FASB issued a new accounting standard requiring disclosures of certain additional expense information on an annual and interim basis, including, among other items, the amounts of purchases of inventory, employee compensation, depreciation and intangible asset amortization included within each income statement expense caption, as applicable. We will adopt this standard in the fiscal year 2028 annual report. We do not expect the adoption of this standard to have a material impact on our Consolidated Financial Statements other than additional disclosures. Note 2 - Stock-Based Compensation Stock-based compensation expense includes restricted stock units, or RSUs, performance stock units, or PSUs, market-based PSUs, and our employee stock purchase plan, or ESPP. 9 NVIDIA CORPORATION AND SUBSIDIARIES NOTES TO CONDENSED CONSOLIDATED FINANCIAL STATEMENTS (Continued) (Unaudited) Condensed Consolidated Statements of Income include stock-based compensation expense, net of amounts capitalized into inventory, as follows: Three Months Ended Nine Months Ended Oct 26, 2025 Oct 27, 2024 Oct 26, 2025 Oct 27, 2024 (In millions) Cost of revenue $ 70 $ 50 $ 192 $ 125 Research and development 1,206 910 3,460 2,469 Sales, general and administrative 379 292 1,101 822 Total $ 1,655 $ 1,252 $ 4,753 $ 3,416 Equity Award Activity The following is a summary of our equity award transactions under our equity incentive plans: RSUs, PSUs and Market-based PSUs Outstanding Number of Shares Weighted Average Grant-Date Fair Value Per Share (In millions, except per share data) Balance as of Jan 26, 2025 274 $ 44.75 Granted 52 $ 114.76 Vested ( 116 ) $ 37.30 Canceled and forfeited ( 7 ) $ 55.62 Balance as of Oct 26, 2025 203 $ 66.59 As of October 26, 2025, aggregate unearned stock-based compensation expense was $ 13.1 billion, which is expected to be recognized over a weighted average period of 2.1 years for RSUs, PSUs, and market-based PSUs, and one year for ESPP. Note 3 - Net Income Per Share The following is the basic and diluted net income per share computations for the periods presented: Three Months Ended Nine Months Ended Oct 26, 2025 Oct 27, 2024 Oct 26, 2025 Oct 27, 2024 (In millions, except per share data) Numerator: Net income $ 31,910 $ 19,309 $ 77,107 $ 50,789 Denominator: Basic weighted average shares 24,327 24,533 24,378 24,577 Dilutive impact of outstanding equity awards 156 241 164 260 Diluted weighted average shares 24,483 24,774 24,542 24,837 Net income per share: Basic (1) $ 1.31 $ 0.79 $ 3.16 $ 2.07 Diluted (2) $ 1.30 $ 0.78 $ 3.14 $ 2.04 Anti-dilutive equity awards excluded from diluted net income per share 6 9 20 72 (1) Net income divided by basic weighted average shares. (2) Net income divided by diluted weighted average shares. Diluted net income per share was computed using the weighted average number of common and potentially dilutive shares outstanding during the period, using the treasury stock method. 10 NVIDIA CORPORATION AND SUBSIDIARIES NOTES TO CONDENSED CONSOLIDATED FINANCIAL STATEMENTS (Continued) (Unaudited) Note 4 - Income Taxes Income tax expense was $ 6.0 billion and $ 3.0 billion for the third quarter, and $ 13.9 billion and $ 8.0 billion for the first nine months, of fiscal years 2026 and 2025, respectively. Income tax as a percentage of income before income tax was an expense of 15.9 % and 13.5 % for the third quarter, and 15.3 % and 13.6 % for the first nine months, of fiscal years 2026 and 2025, respectively. The effective tax rate increased primarily due to a lower percentage of tax benefits from stock-based compensation and U.S. federal research tax credit relative to the increase in income before income tax. Our effective tax rates for the first nine months of fiscal years 2026 and 2025 were lower than the U.S. federal statutory rate of 21% primarily due to tax benefits from foreign-derived deduction eligible income, stock-based compensation, income earned in jurisdictions that are subject to taxes at rates lower than the U.S. federal statutory tax rate, and the U.S. federal research tax credit. In July 2025, the One Big Beautiful Bill Act (OBBBA) was enacted into law and contains several changes to key U.S. federal income tax laws. We have recognized the tax effects of currently effective OBBBA provisions, which are not material and are reflected in our results for the first nine months of fiscal year 2026. Given our current and possible future earnings, we believe that we may release the valuation allowance associated with certain state deferred tax assets in the near term, which would decrease our income tax expense for the period the release is recorded. The timing and amount of the valuation allowance release could vary based on our assessment of all available information. While we believe that we have adequately provided for all uncertain tax positions, or tax positions where we believe it is not more-likely-than-not that the position will be sustained upon review, amounts asserted by tax authorities could be greater or less than our accrued position. Accordingly, our provisions on federal, state and foreign tax related matters to be recorded in the future may change as revised estimates are made or the underlying matters are settled or otherwise resolved with the respective tax authorities. We are currently under examination by the Internal Revenue Service for our fiscal years 2023 and 2024. 11 NVIDIA CORPORATION AND SUBSIDIARIES NOTES TO CONDENSED CONSOLIDATED FINANCIAL STATEMENTS (Continued) (Unaudited) Note 5 - Cash Equivalents and Marketable Securities The fair values of our financial assets are determined using quoted market prices of identical assets or market prices of similar assets from active markets. We review fair value classification on a quarterly basis. The following is a summary of cash equivalents and marketable securities: Oct 26, 2025 Pricing Category Amortized Cost Unrealized Gain Unrealized Loss Estimated Fair Value Reported as Cash Equivalents Marketable Securities (In millions) Debt securities issued by the U.S. Treasury Level 2 $ 22,032 $ 188 $ — $ 22,220 $ 665 $ 21,555 Corporate debt securities Level 2 21,588 172 ( 1 ) 21,759 320 21,439 Money market funds Level 1 8,610 — — 8,610 8,610 — Debt securities issued by U.S. government agencies Level 2 2,206 12 — 2,218 — 2,218 Certificates of deposit Level 2 104 — — 104 104 — Foreign government bonds Level 2 40 1 — 41 — 41 Total debt securities with fair value adjustments recorded in other comprehensive income 54,580 373 ( 1 ) 54,952 9,699 45,253 Publicly-held equity securities (1) Level 1 3,869 — 3,869 Total $ 54,580 $ 373 $ ( 1 ) $ 58,821 $ 9,699 $ 49,122 (1) In the first quarter of fiscal year 2026, one investment was reclassified from non-marketable equity securities to marketable securities following public market trading. Publicly-held equity securities are subject to market price volatility. Net unrealized gains on investments in publicly-held equity securities held at period end were $ 670 million and $ 2.4 billion for the third quarter and first nine months of fiscal year 2026, respectively. Net unrealized gains on investments in publicly-held equity securities held at period end were not significant for the third quarter and first nine months of fiscal year 2025. 12 NVIDIA CORPORATION AND SUBSIDIARIES NOTES TO CONDENSED CONSOLIDATED FINANCIAL STATEMENTS (Continued) (Unaudited) Jan 26, 2025 Pricing Category Amortized Cost Unrealized Gain Unrealized Loss Estimated Fair Value Reported as Cash Equivalents Marketable Securities (In millions) Corporate debt securities Level 2 $ 18,504 $ 51 $ ( 29 ) $ 18,526 $ 2,071 $ 16,455 Debt securities issued by the U.S. Treasury Level 2 16,749 42 ( 22 ) 16,769 1,801 14,968 Money market funds Level 1 3,760 — — 3,760 3,760 — Debt securities issued by U.S. government agencies Level 2 2,775 7 ( 5 ) 2,777 — 2,777 Foreign government bonds Level 2 177 — — 177 137 40 Certificates of deposit Level 2 97 — — 97 97 — Total debt securities with fair value adjustments recorded in other comprehensive income 42,062 100 ( 56 ) 42,106 7,866 34,240 Publicly-held equity securities Level 1 381 — 381 Total $ 42,062 $ 100 $ ( 56 ) $ 42,487 $ 7,866 $ 34,621 The following table provides the breakdown of unrealized losses, aggregated by investment category and length of time that individual debt securities have been in a continuous loss position: Oct 26, 2025 Jan 26, 2025 Less than 12 Months Less than 12 Months Estimated Fair Value Gross Unrealized Loss Estimated Fair Value Gross Unrealized Loss (In millions) Debt securities issued by the U.S. Treasury $ 1,223 $ — $ 6,315 $ ( 22 ) Corporate debt securities 899 ( 1 ) 5,291 ( 29 ) Debt securities issued by U.S. government agencies 75 — 816 ( 5 ) Total $ 2,197 $ ( 1 ) $ 12,422 $ ( 56 ) Gross unrealized losses related to debt securities in a continuous loss position of twelve months or greater, with balances of $ 337 million and $ 213 million as of October 26, 2025 and January 26, 2025, respectively, were not significant. Gross unrealized losses are related to fixed income securities, driven primarily by changes in interest rates. 13 NVIDIA CORPORATION AND SUBSIDIARIES NOTES TO CONDENSED CONSOLIDATED FINANCIAL STATEMENTS (Continued) (Unaudited) The estimated fair value of debt securities included in cash equivalents and marketable securities are shown below by contractual maturity. Oct 26, 2025 (In millions) Less than one year $ 21,848 Due in 1 - 5 years 33,104 Total $ 54,952 Note 6 - Fair Value of Non-marketable Equity Securities Our non-marketable equity securities are recorded in long-term other assets on our Condensed Consolidated Balance Sheets and valued under the measurement alternative. Gains and losses on these investments, realized and unrealized, are recognized in Other income, net on our Condensed Consolidated Statements of Income. Adjustments to the carrying value of our non-marketable equity securities during the third quarter and first nine months of fiscal years 2026 and 2025 were as follows: Three Months Ended Nine Months Ended Oct 26, 2025 Oct 27, 2024 Oct 26, 2025 Oct 27, 2024 (In millions) Balance at beginning of period $ 3,799 $ 1,819 $ 3,387 $ 1,321 Adjustments related to non-marketable equity securities: Net additions 3,704 409 4,652 830 Unrealized gains 758 23 1,088 115 Reclassification (1) — — ( 848 ) — Impairments and unrealized losses ( 74 ) ( 14 ) ( 92 ) ( 29 ) Balance at end of period $ 8,187 $ 2,237 $ 8,187 $ 2,237 (1) Represents reclassifications from non-marketable equity securities to marketable securities following public market trading. Non-marketable equity securities had cumulative gross unrealized gains of $ 1.4 billion and $ 374 million, and cumulative gross unrealized losses and impairments of $ 167 million and $ 74 million on securities held as of October 26, 2025 and October 27, 2024, respectively. Note 7 - Amortizable Intangible Assets and Goodwill The components of our amortizable intangible assets are as follo",
  "0001045810-25-000209": "Risk Factors 32 Item 2. Unregistered Sales of Equity Securities and Use of Proceeds 37 Item 5. Other Information 38 Item 6. Exhibits 39 Signature 40 Where You Can Find More Information Investors and others should note that we announce material financial information to our investors using our investor relations website, press releases, SEC filings and public conference calls and webcasts. We also use the following social media channels as a means of disclosing information about the company, our products, our planned financial and other announcements and attendance at upcoming investor and industry conferences, and other matters, and for complying with our disclosure obligations under Regulation FD: NVIDIA Corporate Blog (http://blogs.nvidia.com) NVIDIA Technical Blog (http://developer.nvidia.com/blog/) NVIDIA LinkedIn Page (http://www.linkedin.com/company/nvidia) NVIDIA Facebook Page (https://www.facebook.com/nvidia) NVIDIA Instagram Page (https://www.instagram.com/nvidia) NVIDIA X Account (https://x.com/nvidia) NVIDIA Threads Page (https://www.threads.com/@nvidia) In addition, investors and others can view NVIDIA videos on YouTube (https://www.YouTube.com/nvidia). The information we post through these social media channels may be deemed material. Accordingly, investors should monitor these accounts and the blog, in addition to following our press releases, SEC filings and public conference calls and webcasts. This list may be updated from time to time. The information we post through these channels is not a part of this Quarterly Report on Form 10-Q. These channels may be updated from time to time on NVIDIA's investor relations website. 2 Part I. Financial Information Item 1. Financial Statements (Unaudited) NVIDIA Corporation and Subsidiaries Condensed Consolidated Statements of Income (In millions, except per share data) (Unaudited) Three Months Ended Six Months Ended Jul 27, 2025 Jul 28, 2024 Jul 27, 2025 Jul 28, 2024 Revenue $ 46,743 $ 30,040 $ 90,805 $ 56,084 Cost of revenue 12,890 7,466 30,284 13,105 Gross profit 33,853 22,574 60,521 42,979 Operating expenses Research and development 4,291 3,090 8,280 5,810 Sales, general and administrative 1,122 842 2,163 1,618 Total operating expenses 5,413 3,932 10,443 7,428 Operating income 28,440 18,642 50,078 35,551 Interest income 592 444 1,108 803 Interest expense ( 62 ) ( 61 ) ( 124 ) ( 125 ) Other income (expense), net 2,236 189 2,055 264 Total other income (expense), net 2,766 572 3,039 942 Income before income tax 31,206 19,214 53,117 36,493 Income tax expense 4,784 2,615 7,920 5,013 Net income $ 26,422 $ 16,599 $ 45,197 $ 31,480 Net income per share: Basic $ 1.08 $ 0.68 $ 1.85 $ 1.28 Diluted $ 1.08 $ 0.67 $ 1.84 $ 1.27 Weighted average shares used in per share computation: Basic 24,366 24,578 24,404 24,599 Diluted 24,532 24,848 24,571 24,869 See accompanying Notes to Condensed Consolidated Financial Statements. 3 NVIDIA Corporation and Subsidiaries Condensed Consolidated Statements of Comprehensive Income (In millions) (Unaudited) Three Months Ended Six Months Ended Jul 27, 2025 Jul 28, 2024 Jul 27, 2025 Jul 28, 2024 Net income $ 26,422 $ 16,599 $ 45,197 $ 31,480 Other comprehensive income (loss), net of tax Available-for-sale securities: Net change in unrealized gain (loss) ( 52 ) 150 87 22 Cash flow hedges: Change in unrealized gain 31 23 54 20 Reclassification adjustments for net realized gain (loss) included in net income 5 ( 8 ) 1 ( 13 ) Net change in unrealized gain 36 15 55 7 Other comprehensive income (loss), net of tax ( 16 ) 165 142 29 Total comprehensive income $ 26,406 $ 16,764 $ 45,339 $ 31,509 See accompanying Notes to Condensed Consolidated Financial Statements. 4 NVIDIA Corporation and Subsidiaries Condensed Consolidated Balance Sheets (In millions) (Unaudited) Jul 27, 2025 Jan 26, 2025 Assets Current assets: Cash and cash equivalents $ 11,639 $ 8,589 Marketable securities 45,152 34,621 Accounts receivable, net 27,808 23,065 Inventories 14,962 10,080 Prepaid expenses and other current assets 2,658 3,771 Total current assets 102,219 80,126 Property and equipment, net 9,141 6,283 Operating lease assets 2,084 1,793 Goodwill 5,755 5,188 Intangible assets, net 755 807 Deferred income tax assets 13,570 10,979 Other assets 7,216 6,425 Total assets $ 140,740 $ 111,601 Liabilities and Shareholders' Equity Current liabilities: Accounts payable $ 9,064 $ 6,310 Accrued and other current liabilities 15,193 11,737 Total current liabilities 24,257 18,047 Long-term debt 8,466 8,463 Long-term operating lease liabilities 1,831 1,519 Other long-term liabilities 6,055 4,245 Total liabilities 40,609 32,274 Commitments and contingencies - see Note 11 Shareholders’ equity: Preferred stock — — Common stock 24 24 Additional paid-in capital 11,200 11,237 Accumulated other comprehensive income 170 28 Retained earnings 88,737 68,038 Total shareholders' equity 100,131 79,327 Total liabilities and shareholders' equity $ 140,740 $ 111,601 See accompanying Notes to Condensed Consolidated Financial Statements. 5 NVIDIA Corporation and Subsidiaries Condensed Consolidated Statements of Shareholders' Equity (Unaudited) Common Stock Outstanding Additional Paid-in Capital Accumulated Other Comprehensive Income (Loss) Retained Earnings Total Shareholders' Equity Shares Amount (In millions, except per share data) Balances as of Apr 27, 2025 24,388 $ 24 $ 11,475 $ 186 $ 72,158 $ 83,843 Net income — — — — 26,422 26,422 Other comprehensive loss — — — ( 16 ) — ( 16 ) Issuance of common stock 39 — — — — — Tax withholding related to common stock ( 13 ) — ( 1,848 ) — — ( 1,848 ) Shares repurchased ( 67 ) — ( 59 ) — ( 9,599 ) ( 9,658 ) Cash dividends declared and paid ($ 0.01 per common share) — — — — ( 244 ) ( 244 ) Stock-based compensation — — 1,632 — — 1,632 Balances as of Jul 27, 2025 24,347 $ 24 $ 11,200 $ 170 $ 88,737 $ 100,131 Balances as of Apr 28, 2024 24,598 $ 25 $ 12,628 $ ( 109 ) $ 36,598 $ 49,142 Net income — — — — 16,599 16,599 Other comprehensive income — — — 165 — 165 Issuance of common stock 38 — — — — — Tax withholding related to common stock ( 11 ) — ( 1,637 ) — — ( 1,637 ) Shares repurchased ( 63 ) — ( 38 ) — ( 6,990 ) ( 7,028 ) Cash dividends declared and paid ($ 0.01 per common share) — — — — ( 246 ) ( 246 ) Stock-based compensation — — 1,162 — — 1,162 Balances as of Jul 28, 2024 24,562 $ 25 $ 12,115 $ 56 $ 45,961 $ 58,157 See accompanying Notes to Condensed Consolidated Financial Statements. 6 NVIDIA Corporation and Subsidiaries Condensed Consolidated Statements of Shareholders' Equity (Unaudited) Common Stock Outstanding Additional Paid-in Capital Accumulated Other Comprehensive Income Retained Earnings Total Shareholders' Equity Shares Amount (In millions, except per share data) Balances, Jan 26, 2025 24,477 $ 24 $ 11,237 $ 28 $ 68,038 $ 79,327 Net income — — — — 45,197 45,197 Other comprehensive income — — — 142 — 142 Issuance of common stock 89 — 370 — — 370 Tax withholding related to common stock ( 26 ) — ( 3,380 ) — — ( 3,380 ) Shares repurchased ( 193 ) — ( 151 ) — ( 24,010 ) ( 24,161 ) Cash dividends declared and paid ($ 0.02 per common share) — — — — ( 488 ) ( 488 ) Fair value of partially vested equity awards assumed in connection with acquisitions — — 22 — — 22 Stock-based compensation — — 3,102 — — 3,102 Balances as of Jul 27, 2025 24,347 $ 24 $ 11,200 $ 170 $ 88,737 $ 100,131 Balances, Jan 28, 2024 24,643 $ 25 $ 13,109 $ 27 $ 29,817 $ 42,978 Net income — — — — 31,480 31,480 Other comprehensive income — — — 29 — 29 Issuance of common stock 113 — 285 — — 285 Tax withholding related to common stock ( 32 ) — ( 3,389 ) — — ( 3,389 ) Shares repurchased ( 162 ) — ( 71 ) — ( 14,992 ) ( 15,063 ) Cash dividends declared and paid ($ 0.014 per common share) — — — — ( 344 ) ( 344 ) Stock-based compensation — — 2,181 — — 2,181 Balances as of Jul 28, 2024 24,562 $ 25 $ 12,115 $ 56 $ 45,961 $ 58,157 See accompanying Notes to Condensed Consolidated Financial Statements. 7 NVIDIA Corporation and Subsidiaries Condensed Consolidated Statements of Cash Flows (In millions) (Unaudited) Six Months Ended Jul 27, 2025 Jul 28, 2024 Cash flows from operating activities: Net income $ 45,197 $ 31,480 Adjustments to reconcile net income to net cash provided by operating activities: Stock-based compensation expense 3,099 2,164 Depreciation and amortization 1,280 843 Deferred income taxes ( 2,160 ) ( 3,276 ) Gains on non-marketable equity securities and publicly-held equity securities, net ( 2,073 ) ( 264 ) Other ( 196 ) ( 288 ) Changes in operating assets and liabilities, net of acquisitions: Accounts receivable ( 4,743 ) ( 4,133 ) Inventories ( 4,880 ) ( 1,380 ) Prepaid expenses and other assets 946 ( 12 ) Accounts payable 2,255 801 Accrued and other current liabilities 3,075 3,314 Other long-term liabilities 979 584 Net cash provided by operating activities 42,779 29,833 Cash flows from investing activities: Proceeds from maturities of marketable securities 6,252 8,098 Proceeds from sales of marketable securities 487 164 Proceeds from sales of non-marketable equity securities 70 105 Purchases of marketable securities ( 14,358 ) ( 15,047 ) Purchases related to property and equipment and intangible assets ( 3,122 ) ( 1,346 ) Purchases of non-marketable equity securities ( 995 ) ( 534 ) Acquisitions, net of cash acquired ( 677 ) ( 317 ) Net cash used in investing activities ( 12,343 ) ( 8,877 ) Cash flows from financing activities: Proceeds related to employee stock plans 370 285 Payments related to repurchases of common stock ( 23,815 ) ( 14,898 ) Payments related to employee stock plan taxes ( 3,380 ) ( 3,389 ) Dividends paid ( 488 ) ( 344 ) Principal payments on property and equipment and intangible assets ( 73 ) ( 69 ) Repayment of debt — ( 1,250 ) Net cash used in financing activities ( 27,386 ) ( 19,665 ) Change in cash and cash equivalents 3,050 1,291 Cash and cash equivalents at beginning of period 8,589 7,280 Cash and cash equivalents at end of period $ 11,639 $ 8,571 Supplemental disclosure of cash flow information: Cash paid for income taxes, net $ 8,451 $ 7,449 See accompanying Notes to Condensed Consolidated Financial Statements. 8 NVIDIA Corporation and Subsidiaries Notes to Condensed Consolidated Financial Statements (Unaudited) Note 1 - Summary of Significant Accounting Policies Basis of Presentation The accompanying unaudited condensed consolidated financial statements were prepared in accordance with accounting principles generally accepted in the United States of America, or U.S. GAAP, for interim financial information and with the instructions to Form 10-Q and Article 10 of Securities and Exchange Commission, or SEC, Regulation S-X. The January 26, 2025 consolidated balance sheet was derived from our audited consolidated financial statements included in our Annual Report on Form 10-K for the fiscal year ended January 26, 2025, as filed with the SEC, but does not include all disclosures required by U.S. GAAP. In the opinion of management, all adjustments, consisting only of normal recurring adjustments considered necessary for a fair presentation of results of operations and financial position, have been included. The results for the interim periods presented are not necessarily indicative of the results expected for any future period. The following information should be read in conjunction with the audited consolidated financial statements and notes thereto included in our Annual Report on Form 10-K for the fiscal year ended January 26, 2025. Certain balances from the prior fiscal year have been reclassified to conform to the current period presentation. Significant Accounting Policies There have been no material changes to our significant accounting policies disclosed in Note 1 - Organization and Summary of Significant Accounting Policies, of the Notes to the Consolidated Financial Statements included in our Annual Report on Form 10-K for the fiscal year ended January 26, 2025. Fiscal Year Fiscal years 2026 and 2025 are both 52-week years ending on the last Sunday in January. The second quarters of fiscal years 2026 and 2025 were both 13-week quarters. Principles of Consolidation Our condensed consolidated financial statements include the accounts of NVIDIA Corporation and our wholly-owned subsidiaries. All intercompany balances and transactions have been eliminated in consolidation. Use of Estimates The preparation of financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosures of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenue and expenses during the reporting period. Actual results could differ materially from our estimates. On an on-going basis, we evaluate our estimates, including those related to accounts receivable, cash equivalents and marketable securities, goodwill, income taxes, inventories and product purchase commitments, investigation and settlement costs, litigation, non-marketable equity securities, other contingencies, property, plant, and equipment, restructuring and other charges, revenue recognition, and stock-based compensation. These estimates are based on historical facts and various other assumptions that we believe are reasonable. Recently Issued Accounting Pronouncements Recent Accounting Pronouncements Not Yet Adopted In December 2023, the FASB issued a new accounting standard which includes new and updated income tax disclosures, including disaggregation of information in the rate reconciliation and income taxes paid. We will adopt this standard in our fiscal year 2026 annual report. We are currently assessing the effect of the adoption of this standard on our disclosures that will be included in our Form 10-K for the fiscal year ending January 25, 2026. In November 2024, the FASB issued a new accounting standard requiring disclosures of certain additional expense information on an annual and interim basis, including, among other items, the amounts of purchases of inventory, employee compensation, depreciation and intangible asset amortization included within each income statement expense caption, as applicable. We will adopt this standard in our fiscal year 2028 annual report. We do not expect the adoption of this standard to have a material impact on our Consolidated Financial Statements other than additional disclosures. Note 2 - Stock-Based Compensation Stock-based compensation expense includes restricted stock units, or RSUs, performance stock units, or PSUs, market-based PSUs, and our employee stock purchase plan, or ESPP. 9 NVIDIA CORPORATION AND SUBSIDIARIES NOTES TO CONDENSED CONSOLIDATED FINANCIAL STATEMENTS (Continued) (Unaudited) Condensed Consolidated Statements of Income include stock-based compensation expense, net of amounts capitalized into inventory, as follows: Three Months Ended Six Months Ended Jul 27, 2025 Jul 28, 2024 Jul 27, 2025 Jul 28, 2024 (In millions) Cost of revenue $ 58 $ 40 $ 123 $ 75 Research and development 1,191 832 2,254 1,559 Sales, general and administrative 375 282 722 530 Total $ 1,624 $ 1,154 $ 3,099 $ 2,164 Equity Award Activity The following is a summary of our equity award transactions under our equity incentive plans: RSUs, PSUs and Market-based PSUs Outstanding Number of Shares Weighted Average Grant-Date Fair Value Per Share (In millions, except per share data) Balance as of Jan 26, 2025 274 $ 44.75 Granted 48 $ 108.52 Vested ( 78 ) $ 36.00 Canceled and forfeited ( 5 ) $ 52.34 Balance as of Jul 27, 2025 239 $ 60.19 As of July 27, 2025, aggregate unearned stock-based compensation expense was $ 14.0 billion, which is expected to be recognized over a weighted average period of 2.2 years for RSUs, PSUs, and market-based PSUs, and one year for ESPP. Note 3 - Net Income Per Share The following is the basic and diluted net income per share computations for the periods presented: Three Months Ended Six Months Ended Jul 27, 2025 Jul 28, 2024 Jul 27, 2025 Jul 28, 2024 (In millions, except per share data) Numerator: Net income $ 26,422 $ 16,599 $ 45,197 $ 31,480 Denominator: Basic weighted average shares 24,366 24,578 24,404 24,599 Dilutive impact of outstanding equity awards 166 270 167 270 Diluted weighted average shares 24,532 24,848 24,571 24,869 Net income per share: Basic (1) $ 1.08 $ 0.68 $ 1.85 $ 1.28 Diluted (2) $ 1.08 $ 0.67 $ 1.84 $ 1.27 Anti-dilutive equity awards excluded from diluted net income per share 3 5 60 68 (1) Net income divided by basic weighted average shares. (2) Net income divided by diluted weighted average shares. Diluted net income per share was computed using the weighted average number of common and potentially dilutive shares outstanding during the period, using the treasury stock method. 10 NVIDIA CORPORATION AND SUBSIDIARIES NOTES TO CONDENSED CONSOLIDATED FINANCIAL STATEMENTS (Continued) (Unaudited) Note 4 - Income Taxes Income tax expense was $ 4.8 billion and $ 2.6 billion for the second quarter, and $ 7.9 billion and $ 5.0 billion for the first half, of fiscal years 2026 and 2025, respectively. Income tax as a percentage of income before income tax was an expense of 15.3 % and 13.6 % for the second quarter, and 14.9 % and 13.7 % for the first half, of fiscal years 2026 and 2025, respectively. The effective tax rate increased primarily due to a lower tax benefit from stock-based compensation, partially offset by an increase in tax benefit from foreign-derived deduction eligible income. Our effective tax rates for the first half of fiscal years 2026 and 2025 were lower than the U.S. federal statutory rate of 21% primarily due to tax benefits from foreign-derived deduction eligible income, stock-based compensation, income earned in jurisdictions that are subject to taxes at rates lower than the U.S. federal statutory tax rate, and the U.S. federal research tax credit. In July 2025, the One Big Beautiful Bill Act (OBBBA) was enacted into law and contains several changes to key U.S. federal income tax laws. As of July 27, 2025, we have recognized the tax effects of certain OBBBA provisions, which did not have a material impact on our second quarter. Given our current and possible future earnings, we believe that we may release the valuation allowance associated with certain state deferred tax assets in the near term, which would decrease our income tax expense for the period the release is recorded. The timing and amount of the valuation allowance release could vary based on our assessment of all available information. While we believe that we have adequately provided for all uncertain tax positions, or tax positions where we believe it is not more-likely-than-not that the position will be sustained upon review, amounts asserted by tax authorities could be greater or less than our accrued position. Accordingly, our provisions on federal, state and foreign tax related matters to be recorded in the future may change as revised estimates are made or the underlying matters are settled or otherwise resolved with the respective tax authorities. 11 NVIDIA CORPORATION AND SUBSIDIARIES NOTES TO CONDENSED CONSOLIDATED FINANCIAL STATEMENTS (Continued) (Unaudited) Note 5 - Cash Equivalents and Marketable Securities The fair values of our financial assets are determined using quoted market prices of identical assets or market prices of similar assets from active markets. We review fair value classification on a quarterly basis. The following is a summary of cash equivalents and marketable securities: Jul 27, 2025 Pricing Category Amortized Cost Unrealized Gain Unrealized Loss Estimated Fair Value Reported as Cash Equivalents Marketable Securities (In millions) Debt securities issued by the U.S. Treasury Level 2 $ 23,967 $ 76 $ ( 11 ) $ 24,032 $ 3,784 $ 20,248 Corporate debt securities Level 2 21,564 81 ( 9 ) 21,636 2,214 19,422 Money market funds Level 1 5,245 — — 5,245 5,245 — Debt securities issued by U.S. government agencies Level 2 2,238 7 ( 2 ) 2,243 — 2,243 Certificates of deposit Level 2 108 — — 108 108 — Foreign government bonds Level 2 40 — — 40 — 40 Total debt securities with fair value adjustments recorded in other comprehensive income 53,162 164 ( 22 ) 53,304 11,351 41,953 Publicly-held equity securities (1) Level 1 3,199 — 3,199 Total $ 53,162 $ 164 $ ( 22 ) $ 56,503 $ 11,351 $ 45,152 (1) In the first quarter of fiscal year 2026, one investment was reclassified from non-marketable equity securities to marketable securities following public market trading. The fair value of the investment as of July 27, 2025 was $ 2.8 billion and was subject to a short-term restriction on the ability to sell. Publicly-held equity securities are subject to market price volatility. Net unrealized gains on investments in publicly-held equity securities held at period end were $ 1.9 billion and $ 1.7 billion for the second quarter and first half of fiscal year 2026, respectively. Net unrealized gains on investments in publicly-held equity securities held at period end were $ 132 million and $ 181 million for the second quarter and first half of fiscal year 2025, respectively. 12 NVIDIA CORPORATION AND SUBSIDIARIES NOTES TO CONDENSED CONSOLIDATED FINANCIAL STATEMENTS (Continued) (Unaudited) Jan 26, 2025 Pricing Category Amortized Cost Unrealized Gain Unrealized Loss Estimated Fair Value Reported as Cash Equivalents Marketable Securities (In millions) Corporate debt securities Level 2 $ 18,504 $ 51 $ ( 29 ) $ 18,526 $ 2,071 $ 16,455 Debt securities issued by the U.S. Treasury Level 2 16,749 42 ( 22 ) 16,769 1,801 14,968 Money market funds Level 1 3,760 — — 3,760 3,760 — Debt securities issued by U.S. government agencies Level 2 2,775 7 ( 5 ) 2,777 — 2,777 Foreign government bonds Level 2 177 — — 177 137 40 Certificates of deposit Level 2 97 — — 97 97 — Total debt securities with fair value adjustments recorded in other comprehensive income 42,062 100 ( 56 ) 42,106 7,866 34,240 Publicly-held equity securities Level 1 381 — 381 Total $ 42,062 $ 100 $ ( 56 ) $ 42,487 $ 7,866 $ 34,621 The following table provides the breakdown of unrealized losses, aggregated by investment category and length of time that individual debt securities have been in a continuous loss position: Jul 27, 2025 Jan 26, 2025 Less than 12 Months Less than 12 Months Estimated Fair Value Gross Unrealized Loss Estimated Fair Value Gross Unrealized Loss (In millions) Debt securities issued by the U.S. Treasury $ 7,319 $ ( 11 ) $ 6,315 $ ( 22 ) Corporate debt securities 3,539 ( 9 ) 5,291 ( 29 ) Debt securities issued by U.S. government agencies 768 ( 2 ) 816 ( 5 ) Total $ 11,626 $ ( 22 ) $ 12,422 $ ( 56 ) Gross unrealized losses related to debt securities in a continuous loss position of twelve months or greater, with balances of $ 15 million and $ 213 million as of July 27, 2025 and January 26, 2025, respectively, were not significant. Gross unrealized losses are related to fixed income securities, driven primarily by changes in interest rates. 13 NVIDIA CORPORATION AND SUBSIDIARIES NOTES TO CONDENSED CONSOLIDATED FINANCIAL STATEMENTS (Continued) (Unaudited) The estimated fair value of debt securities included in cash equivalents and marketable securities are shown below by contractual maturity. Jul 27, 2025 (In millions) Less than one year $ 22,521 Due in 1 - 5 years 30,783 Total $ 53,304 Note 6 - Fair Value of Non-marketable Equity Securities Our non-marketable equity securities are recorded in long-term other assets on our Condensed Consolidated Balance Sheets and valued under the measurement alternative. Gains and losses on these investments, realized and unrealized, are recognized in Other income (expense), net on our Condensed Consolidated Statements of Income. Adjustments to the carrying value of our non-marketable equity securities during the second quarter and first half of fiscal years 2026 and 2025 were as follows: Three Months Ended Six Months Ended Jul 27, 2025 Jul 28, 2024 Jul 27, 2025 Jul 28, 2024 (In millions) Balance at beginning of period $ 3,240 $ 1,463 $ 3,387 $ 1,321 Adjustments related to non-marketable equity securities: Net additions 299 294 948 421 Unrealized gains 267 77 330 92 Reclassification (1) ( 5 ) — ( 848 ) — Impairments and unrealized losses ( 2 ) ( 15 ) ( 18 ) ( 15 ) Balance at end of period $ 3,799 $ 1,819 $ 3,799 $ 1,819 (1) Represents reclassifications from non-marketable equity securities to marketable securities following public market trading. Non-marketable equity securities had cumulative gross unrealized gains of $ 661 million and $ 362 million, and cumulative gross unrealized losses and impairments of $ 93 million and $ 60 million on securities held as of July 27, 2025 and July 28, 2024, respectively. Note 7 - Amortizable Intangible Assets and Goodwill The components of our amortizable intangible assets are as follows: Jul 27, 2025 Jan 26, 2025 Gross Carrying Amount Accumulated Amortization Net Carrying Amount Gros"
}