{
  "0001652044-25-000091": "Risk Factors 52 Item 2 Unregistered Sales of Equity Securities and Use of Proceeds 52 Item 5 Other Information 52 Item 6 Exhibits 54 Signatures 55 2 Table of Contents Alphabet Inc. Note About Forward-Looking Statements This Quarterly Report on Form 10-Q contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These include, among other things, statements regarding: • the growth of our business and revenues and our expectations about the factors that influence our success and trends in our business; • fluctuations in our revenues and margins and various factors contributing to such fluctuations; • our expectation that the continuing shift to an online world as the digital economy evolves will continue to benefit our business; • our expectation that the revenues that we derive beyond advertising will continue to increase and may affect our margins; • our expectation that our traffic acquisition costs (TAC) and the associated TAC rate will fluctuate, which could affect our overall margins; • our expectation that our monetization trends will fluctuate, which could affect our revenues and margins; • fluctuations in paid clicks and cost-per-click as well as impressions and cost-per-impression, and various factors contributing to such fluctuations; • our expectation that we will continue to periodically review, refine, and update our methodologies for monitoring, gathering, and counting the number of paid clicks and impressions, and for identifying the revenues generated by the corresponding click and impression activity; • our expectation that our results will be affected by our performance in international markets as users in developing economies increasingly come online; • our expectation that our foreign exchange risk management program will not fully offset our net exposure to fluctuations in foreign currency exchange rates; • the expected variability of gains and losses related to hedging activities under our foreign exchange risk management program; • the amount and timing of revenue recognition from customer contracts with commitments for performance obligations, including our estimate of the remaining amount of commitments and when we expect to recognize revenue; • our expectation that our capital expenditures will increase, including our expected spend and the expected increase in our technical infrastructure investment to support the growth of our business and our long-term initiatives, in particular in support of artificial intelligence (AI) products and services; • our plans to continue to invest in new businesses, products, services and technologies, and systems, as well as to continue to invest in acquisitions and strategic investments; • our pace of hiring and our plans to provide competitive compensation programs; • our expectation that our cost of revenues, research and development (R&D) expenses, sales and marketing expenses, and general and administrative expenses may increase in amount and/or may increase as a percentage of revenues and may be affected by a number of factors; • estimates of our future employee compensation expenses; • our expectation that our other income (expense), net (OI&E), will fluctuate in the future, as it is largely driven by market dynamics; • fluctuations in our effective tax rate; • seasonal fluctuations in internet usage, advertising expenditures, and underlying business trends such as traditional retail seasonality, which are likely to cause fluctuations in our quarterly results; • the sufficiency of our sources of funding; • our potential exposure in connection with new and pending investigations, proceedings, and other contingencies, including the possibility that certain legal proceedings to which we are a party could harm our business, financial condition, and operating results; 3 Table of Contents Alphabet Inc. • our expectation that we will continue to face heightened regulatory scrutiny, and changes in regulatory conditions, laws, and public policies, which could affect our business practices and financial results; • the expected timing, amount, and effect of Alphabet Inc.'s share repurchases and dividends; • our long-term sustainability goals; • our expectations regarding the timing and successful closing and integration of the Wiz, Inc. (\"Wiz\") acquisition, including the realization of anticipated benefits; and • ongoing developments surrounding international trade and the related impact on the macroeconomic environment and our business; as well as other statements regarding our future operations, financial condition and prospects, and business strategies. Forward-looking statements may appear throughout this report and other documents we file with the Securities and Exchange Commission (SEC), including without limitation, the following sections: Part I, Item 2, \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in this Quarterly Report on Form 10-Q and Part I, Item 1A, “Risk Factors” in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024. Forward-looking statements generally can be identified by words such as \"anticipates,\" \"believes,\" \"could,\" \"estimates,\" \"expects,\" \"intends,\" \"may,\" \"plans,\" \"predicts,\" \"projects,\" \"will be,\" \"will continue,\" \"will likely result,\" and similar expressions. These forward-looking statements are based on current expectations and assumptions that are subject to risks and uncertainties, which could cause our actual results to differ materially from those reflected in the forward-looking statements. Factors that could cause or contribute to such differences include, but are not limited to, those discussed in this Quarterly Report on Form 10-Q; the risks discussed in Part I, Item 1A, \"Risk Factors\" and the trends discussed in Part II, Item 7, \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024; and those discussed in other documents we file with the SEC. We undertake no obligation to revise or publicly release the results of any revision to these forward-looking statements, except as required by law. Given these risks and uncertainties, readers are cautioned not to place undue reliance on such forward-looking statements. As used herein, \"Alphabet,\" \"the company,\" \"we,\" \"us,\" \"our,\" and similar terms include Alphabet Inc. and its subsidiaries, unless the context indicates otherwise. \"Alphabet,\" \"Google,\" and other trademarks of ours appearing in this report are our property. We do not intend our use or display of other companies' trade names or trademarks to imply an endorsement or sponsorship of us by such companies, or any relationship with any of these companies. 4 Table of Contents Alphabet Inc. PART I. FINANCIAL INFORMATION ITEM 1. FINANCIAL STATEMENTS Alphabet Inc. CONSOLIDATED BALANCE SHEETS (in millions, except par value per share amounts) As of December 31, 2024 As of September 30, 2025 (unaudited) Assets Current assets: Cash and cash equivalents $ 23,466 $ 23,090 Marketable securities 72,191 75,406 Total cash, cash equivalents, and marketable securities 95,657 98,496 Accounts receivable, net 52,340 57,148 Other current assets 15,714 18,303 Total current assets 163,711 173,947 Non-marketable securities 37,982 63,800 Deferred income taxes 17,180 10,331 Property and equipment, net 171,036 223,787 Operating lease assets 13,588 14,524 Goodwill 31,885 33,269 Other non-current assets 14,874 16,811 Total assets $ 450,256 $ 536,469 Liabilities and Stockholders’ Equity Current liabilities: Accounts payable $ 7,987 $ 10,546 Accrued compensation and benefits 15,069 13,944 Accrued expenses and other current liabilities 51,228 59,437 Accrued revenue share 9,802 10,081 Deferred revenue 5,036 5,542 Total current liabilities 89,122 99,550 Long-term debt 10,883 21,607 Income taxes payable, non-current 8,782 10,072 Operating lease liabilities 11,691 12,106 Other long-term liabilities 4,694 6,267 Total liabilities 125,172 149,602 Commitments and Contingencies (Note 10) Stockholders’ equity: Preferred stock, $ 0.001 par value per share, 100 shares authorized; no shares issued and outstanding 0 0 Class A, Class B, and Class C stock and additional paid-in capital, $ 0.001 par value per share: 300,000 shares authorized (Class A 180,000 , Class B 60,000 , Class C 60,000 ); 12,211 (Class A 5,835 , Class B 861 , Class C 5,515 ) and 12,077 (Class A 5,818 , Class B 842 , Class C 5,417 ) s hares issued and outstanding 84,800 91,695 Accumulated other comprehensive income (loss) ( 4,800 ) ( 2,054 ) Retained earnings 245,084 297,226 Total stockholders’ equity 325,084 386,867 Total liabilities and stockholders’ equity $ 450,256 $ 536,469 See accompanying notes. 5 Table of Contents Alphabet Inc. Alphabet Inc. CONSOLIDATED STATEMENTS OF INCOME (in millions, except per share amounts; unaudited) Three Months Ended Nine Months Ended September 30, September 30, 2024 2025 2024 2025 Revenues $ 88,268 $ 102,346 $ 253,549 $ 289,007 Costs and expenses: Cost of revenues 36,474 41,369 105,693 116,768 Research and development 12,447 15,151 36,210 42,515 Sales and marketing 7,227 7,205 20,445 20,478 General and administrative 3,599 7,393 9,783 16,141 Total costs and expenses 59,747 71,118 172,131 195,902 Income from operations 28,521 31,228 81,418 93,105 Other income (expense), net 3,185 12,759 6,154 26,604 Income before income taxes 31,706 43,987 87,572 119,709 Provision for income taxes 5,405 9,008 13,990 21,994 Net income $ 26,301 $ 34,979 $ 73,582 $ 97,715 Basic net income per share (Note 12) $ 2.14 $ 2.89 $ 5.96 $ 8.06 Diluted net income per share (Note 12) $ 2.12 $ 2.87 $ 5.90 $ 7.99 See accompanying notes. 6 Table of Contents Alphabet Inc. Alphabet Inc. CONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME (in millions; unaudited) Three Months Ended Nine Months Ended September 30, September 30, 2024 2025 2024 2025 Net income $ 26,301 $ 34,979 $ 73,582 $ 97,715 Other comprehensive income (loss): Change in foreign currency translation adjustment, net of income tax benefit (expense) of $ 93 , $( 60 ), $ 49 , and $ 175 1,184 ( 642 ) 234 2,631 Available-for-sale investments: Change in net unrealized gains (losses) 1,208 230 755 1,066 Less: reclassification adjustment for net (gains) losses included in net income 88 ( 36 ) 629 ( 149 ) Net change, net of income tax benefit (expense) of $( 368 ), $( 54 ), $( 394 ), and $( 259 ) 1,296 194 1,384 917 Cash flow hedges: Change in net unrealized gains (losses) ( 698 ) 338 ( 280 ) ( 895 ) Less: reclassification adjustment for net (gains) losses included in net income 2 183 ( 164 ) 93 Net change, net of income tax benefit (expense) of $ 138 , $( 123 ), $ 88 , and $ 216 ( 696 ) 521 ( 444 ) ( 802 ) Other comprehensive income (loss) 1,784 73 1,174 2,746 Comprehensive income $ 28,085 $ 35,052 $ 74,756 $ 100,461 See accompanying notes. 7 Table of Contents Alphabet Inc. Alphabet Inc. CONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY (in millions; unaudited) Three Months Ended September 30, 2024 Class A, Class B, Class C Stock and Additional Paid-In Capital Accumulated Other Comprehensive Income (Loss) Retained Earnings Total Stockholders’ Equity Shares Amount Balance as of June 30, 2024 12,322 $ 79,732 $ ( 5,012 ) $ 226,033 $ 300,753 Stock issued 32 0 0 0 0 Stock-based compensation 0 5,903 0 0 5,903 Tax withholding related to vesting of restricted stock units and other 0 ( 3,082 ) 0 ( 14 ) ( 3,096 ) Repurchases of stock ( 90 ) ( 822 ) 0 ( 14,477 ) ( 15,299 ) Dividends and dividend equivalents declared ($ 0.20 per share) 0 14 0 ( 2,526 ) ( 2,512 ) Sale of interest in consolidated entities 0 285 0 0 285 Net income 0 0 0 26,301 26,301 Other comprehensive income (loss) 0 0 1,784 0 1,784 Balance as of September 30, 2024 12,264 $ 82,030 $ ( 3,228 ) $ 235,317 $ 314,119 Nine Months Ended September 30, 2024 Class A, Class B, Class C Stock and Additional Paid-In Capital Accumulated Other Comprehensive Income (Loss) Retained Earnings Total Stockholders’ Equity Shares Amount Balance as of December 31, 2023 12,460 $ 76,534 $ ( 4,402 ) $ 211,247 $ 283,379 Stock issued 97 0 0 0 0 Stock-based compensation 0 17,104 0 0 17,104 Tax withholding related to vesting of restricted stock units and other 0 ( 9,390 ) 0 ( 14 ) ( 9,404 ) Repurchases of stock ( 293 ) ( 2,529 ) 0 ( 44,425 ) ( 46,954 ) Dividends and dividend equivalents declared ($ 0.40 per share) 0 18 0 ( 5,073 ) ( 5,055 ) Sale of interest in consolidated entities 0 293 0 0 293 Net income 0 0 0 73,582 73,582 Other comprehensive income (loss) 0 0 1,174 0 1,174 Balance as of September 30, 2024 12,264 $ 82,030 $ ( 3,228 ) $ 235,317 $ 314,119 8 Table of Contents Alphabet Inc. Three Months Ended September 30, 2025 Class A, Class B, Class C Stock and Additional Paid-In Capital Accumulated Other Comprehensive Income (Loss) Retained Earnings Total Stockholders’ Equity Shares Amount Balance as of June 30, 2025 12,104 $ 89,283 $ ( 2,127 ) $ 275,760 $ 362,916 Stock issued 29 0 0 0 0 Stock-based compensation 0 6,413 0 0 6,413 Tax withholding related to vesting of restricted stock units and other 0 ( 3,400 ) 0 0 ( 3,400 ) Repurchases of stock ( 56 ) ( 641 ) 0 ( 10,912 ) ( 11,553 ) Dividends and dividend equivalents declared ($ 0.21 per share) 0 40 0 ( 2,601 ) ( 2,561 ) Sale of interest in consolidated entities 0 0 0 0 0 Net income 0 0 0 34,979 34,979 Other comprehensive income (loss) 0 $ 0 $ 73 $ 0 $ 73 Balance as of September 30, 2025 12,077 $ 91,695 $ ( 2,054 ) $ 297,226 $ 386,867 Nine Months Ended September 30, 2025 Class A, Class B, Class C Stock and Additional Paid-In Capital Accumulated Other Comprehensive Income (Loss) Retained Earnings Total Stockholders’ Equity Shares Amount Balance as of December 31, 2024 12,211 $ 84,800 $ ( 4,800 ) $ 245,084 $ 325,084 Stock issued 86 0 0 0 0 Stock-based compensation 0 18,011 0 0 18,011 Tax withholding related to vesting of restricted stock units and other 0 ( 9,349 ) 0 0 ( 9,349 ) Repurchases of stock ( 220 ) ( 2,267 ) 0 ( 37,850 ) ( 40,117 ) Dividends and dividend equivalents decla red ($ 0.62 per share) 0 100 0 ( 7,723 ) ( 7,623 ) Sale of interest in consolidated entities 0 400 0 0 400 Net income 0 0 0 97,715 97,715 Other comprehensive income (loss) 0 0 2,746 0 2,746 Balance as of September 30, 2025 12,077 $ 91,695 $ ( 2,054 ) $ 297,226 $ 386,867 See accompanying notes. 9 Table of Contents Alphabet Inc. Alphabet Inc. CONSOLIDATED STATEMENTS OF CASH FLOWS (in millions; unaudited) Nine Months Ended September 30, 2024 2025 Operating activities Net income $ 73,582 $ 97,715 Adjustments: Depreciation of property and equipment 11,106 15,096 Stock-based compensation expense 16,975 17,882 Deferred income taxes ( 3,809 ) 7,130 Loss (gain) on debt and equity securities, net ( 2,738 ) ( 22,266 ) Other 2,592 843 Changes in assets and liabilities, net of effects of acquisitions: Accounts receivable, net ( 1,321 ) ( 3,582 ) Income taxes, net ( 2,797 ) ( 3,292 ) Other assets ( 2,334 ) ( 4,060 ) Accounts payable ( 42 ) ( 771 ) Accrued expenses and other liabilities ( 6,366 ) 6,199 Accrued revenue share 478 100 Deferred revenue 860 1,317 Net cash provided by operating activities 86,186 112,311 Investing activities Purchases of property and equipment ( 38,259 ) ( 63,596 ) Purchases of marketable securities ( 65,034 ) ( 60,834 ) Maturities and sales of marketable securities 81,779 61,301 Purchases of non-marketable securities ( 3,234 ) ( 3,312 ) Maturities and sales of non-marketable securities 732 1,196 Acquisitions, net of cash acquired, and purchases of intangible assets ( 2,840 ) ( 1,425 ) Other investing activities ( 2,500 ) ( 1,845 ) Net cash used in investing activities ( 29,356 ) ( 68,515 ) Financing activities Net payments related to stock-based award activities ( 9,141 ) ( 9,001 ) Repurchases of stock ( 46,671 ) ( 40,210 ) Dividend payments ( 4,921 ) ( 7,513 ) Proceeds from issuance of debt, net of costs 8,694 38,002 Repayments of debt ( 8,951 ) ( 26,094 ) Proceeds from sale of interest in consolidated entities, net 293 400 Net cash used in financing activities ( 60,697 ) ( 44,416 ) Effect of exchange rate changes on cash and cash equivalents ( 222 ) 244 Net increase (decrease) in cash and cash equivalents ( 4,089 ) ( 376 ) Cash and cash equivalents at beginning of period 24,048 23,466 Cash and cash equivalents at end of period $ 19,959 $ 23,090 See accompanying notes. 10 Table of Contents Alphabet Inc. Alphabet Inc. NOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Unaudited) Note 1. Summary of Significant Accounting Policies Nature of Operations Google was incorporated in California in September 1998 and re-incorporated in the State of Delaware in August 2003. In 2015, we implemented a holding company reorganization, and as a result, Alphabet Inc. (\"Alphabet\") became the successor issuer to Google. We generate revenues by delivering relevant, cost-effective online advertising; cloud-based solutions that provide enterprise customers of all sizes with infrastructure, platform services, and applications; sales of other products and services, such as fees received for subscription-based products, apps and in-app purchases, and devices. Basis of Consolidation The consolidated financial statements of Alphabet include the accounts of Alphabet and entities consolidated under the variable interest and voting models. Intercompany balances and transactions have been eliminated. Unaudited Interim Financial Information These unaudited interim consolidated financial statements have been prepared in accordance with generally accepted accounting principles in the United States (GAAP), and in our opinion, include all adjustments of a normal recurring nature necessary for fair financial statement presentation. Interim results are not necessarily indicative of the results to be expected for the full year ending December 31, 2025. We have made estimates and assumptions that affect the amounts reported and disclosed in the financial statements and the accompanying notes. Actual results could differ materially from these estimates. These consolidated financial statements and other information presented in this Form 10-Q should be read in conjunction with the consolidated financial statements and the related notes included in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024 filed with the SEC. Recently Issued Accounting Pronouncements Not Yet Adopted In December 2023, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) 2023-09 \"Income Taxes (Topics 740): Improvements to Income Tax Disclosures\" to expand the disclosure requirements for income taxes. Upon adoption, we will be required to disclose additional specified categories in the rate reconciliation in both percentage and dollar amounts. We will also be required to disclose the amount of income taxes paid disaggregated by jurisdiction, among other disclosure requirements. The standard, which is effective for our 2025 annual period, will be applied retrospectively. In November 2024, the FASB issued ASU 2024-03 \"Income Statement: Reporting Comprehensive Income-Expense Disaggregation Disclosures (Subtopic 220-40)\" to improve the disclosures about an entity’s expenses. Upon adoption, we will be required to disclose in the notes to the financial statements a disaggregation of certain expense categories included within the expense captions on the face of the income statement. The standard is effective for our 2027 annual period, and our interim periods beginning in 2028, with early adoption permitted. The standard can be applied either prospectively or retrospectively. We are currently assessing adoption timing and the effect that the updated standard will have on our financial statement disclosures. In September 2025, the FASB issued ASU 2025-06 \"Intangibles: Goodwill and Other‒Internal-Use Software (Subtopic 350-40): Targeted Improvements to the Accounting for Internal-Use Software\" to modernize the accounting for software costs under Subtopic 350-40, Intangibles‒Goodwill and Other‒Internal-Use Software (referred to as “internal-use software”). Upon adoption, we will be required to account for internal-use software under the updated capitalization criteria. The standard is effective for our interim and annual 2028 periods, with early adoption permitted. The standard can be applied either prospectively, retrospectively, or under a modified transition approach. We are currently assessing adoption timing and the method of adoption. Prior Period Reclassifications Certain amounts in prior periods have been reclassified to conform with current period presentation. 11 Table of Contents Alphabet Inc. Note 2. Revenues Disaggregated Revenues The following table presents revenues disaggregated by type (in millions): Three Months Ended Nine Months Ended September 30, September 30, 2024 2025 2024 2025 Google Search & other $ 49,385 $ 56,567 $ 144,050 $ 161,459 YouTube ads 8,921 10,261 25,674 28,984 Google Network 7,548 7,354 22,405 21,964 Google advertising 65,854 74,182 192,129 212,407 Google subscriptions, platforms, and devices 10,656 12,870 28,707 34,452 Google Services total 76,510 87,052 220,836 246,859 Google Cloud 11,353 15,157 31,274 41,041 Other Bets 388 344 1,248 1,167 Hedging gains (losses) 17 ( 207 ) 191 ( 60 ) Total revenues $ 88,268 $ 102,346 $ 253,549 $ 289,007 The following table presents revenues disaggregated by geography, based on the addresses of our customers (in millions): Three Months Ended Nine Months Ended September 30, September 30, 2024 2025 2024 2025 United States $ 43,139 49 % $ 48,758 48 % $ 123,072 49 % $ 138,785 48 % EMEA (1) 25,472 29 29,911 29 73,943 29 84,096 29 APAC (1) 14,547 16 17,819 17 41,659 16 49,153 17 Other Americas (1) 5,093 6 6,065 6 14,684 6 17,033 6 Hedging gains (losses) 17 0 ( 207 ) 0 191 0 ( 60 ) 0 Total revenues $ 88,268 100 % $ 102,346 100 % $ 253,549 100 % $ 289,007 100 % (1) Regions represent Europe, the Middle East, and Africa (EMEA); Asia-Pacific (APAC); and Canada and Latin America (\"Other Americas\"). Revenue Backlog As of September 30, 2025, we had $ 157.7 billion of remaining performance obligations (“revenue backlog”), primarily related to Google Cloud. Revenue backlog represents commitm ents in customer contracts that have not yet been recognized as revenue. We expect to r ecognize just over 55 % of the revenue backlog as revenues over the next 24 months with the remainder to be recognized thereafter. The estimated revenue backlog and timing of revenue recognition for these commitments is largely driv en by our ability to deliver in accordance with relevant contract terms and when our customers utilize services. Revenue backlog includes related deferred revenue currently recorded as well as amounts that will be invoiced in future periods, and excludes contracts with an original expected term of one year or less and cancellable contracts. Deferred Revenues We record deferred revenues when cash payments are received or due in advance of our performance, including amounts which are refundable. Deferred revenues primarily relate to Google Cloud and Google s ubscriptions, platforms, and devices. Total deferred revenue as of December 31, 2024 was $ 6.0 billion, of which $ 4.1 billion was recognized as revenues for the nine months ended September 30, 2025. Total deferred revenue as of September 30, 2025 was $ 7.4 billion. Note 3. Financial Instruments Fair Value Measurements Investments Measured at Fair Value on a Recurring Basis Cash, cash equivalents, and marketable equity securities are measured at fair value and classified within 12 Table of Contents Alphabet Inc. Level 1 and Level 2 in the fair value hierarchy, because we use quoted prices for identical assets in active markets or inputs that are based upon quoted prices for similar instruments in active markets. Debt securities are measured at fair value and classified within Level 2 in the fair value hierarchy, because we use quoted market prices to the extent available or alternative pricing sources and models utilizing market observable inputs to determine fair value. For certain marketable debt securities, we have elected the fair value option for which changes in fair value are recorded in OI&E. The fair value option was elected for these securities to align with the unrealized gains and losses from related derivative contracts. The following tables summarize our cash, cash equivalents, and marketable securities measured at fair value on a recurring basis (in millions): As of December 31, 2024 Fair Value Hierarchy Adjusted Cost Gross Unrealized Gains Gross Unrealized Losses Fair Value Cash and Cash Equivalents Marketable Securities Fair value changes recorded in other comprehensive income Time deposits Level 2 $ 2,217 $ 0 $ 0 $ 2,217 $ 2,081 $ 136 Government bonds Level 2 27,551 83 ( 214 ) 27,420 50 27,370 Corporate debt securities Level 2 18,300 79 ( 222 ) 18,157 0 18,157 ",
  "0001652044-25-000062": "Risk Factors 52 Item 2 Unregistered Sales of Equity Securities and Use of Proceeds 52 Item 5 Other Information 52 Item 6 Exhibits 54 Signatures 56 2 Table of Contents Alphabet Inc. Note About Forward-Looking Statements This Quarterly Report on Form 10-Q contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These include, among other things, statements regarding: • the growth of our business and revenues and our expectations about the factors that influence our success and trends in our business; • fluctuations in our revenues and margins and various factors contributing to such fluctuations; • our expectation that the continuing shift to an online world as the digital economy evolves will continue to benefit our business; • our expectation that the revenues that we derive beyond advertising will continue to increase and may affect our margins; • our expectation that our traffic acquisition costs (TAC) and the associated TAC rate will fluctuate, which could affect our overall margins; • our expectation that our monetization trends will fluctuate, which could affect our revenues and margins; • fluctuations in paid clicks and cost-per-click as well as impressions and cost-per-impression, and various factors contributing to such fluctuations; • our expectation that we will continue to periodically review, refine, and update our methodologies for monitoring, gathering, and counting the number of paid clicks and impressions, and for identifying the revenues generated by the corresponding click and impression activity; • our expectation that our results will be affected by our performance in international markets as users in developing economies increasingly come online; • our expectation that our foreign exchange risk management program will not fully offset our net exposure to fluctuations in foreign currency exchange rates; • the expected variability of gains and losses related to hedging activities under our foreign exchange risk management program; • the amount and timing of revenue recognition from customer contracts with commitments for performance obligations, including our estimate of the remaining amount of commitments and when we expect to recognize revenue; • our expectation that our capital expenditures will increase, including our expected spend and the expected increase in our technical infrastructure investment to support the growth of our business and our long-term initiatives, in particular in support of artificial intelligence (AI) products and services; • our plans to continue to invest in new businesses, products, services and technologies, and systems, as well as to continue to invest in acquisitions and strategic investments; • our pace of hiring and our plans to provide competitive compensation programs; • our expectation that our cost of revenues, research and development (R&D) expenses, sales and marketing expenses, and general and administrative expenses may increase in amount and/or may increase as a percentage of revenues and may be affected by a number of factors; • estimates of our future employee compensation expenses; • our expectation that our other income (expense), net (OI&E), will fluctuate in the future, as it is largely driven by market dynamics; • fluctuations in our effective tax rate; • seasonal fluctuations in internet usage, advertising expenditures, and underlying business trends such as traditional retail seasonality, which are likely to cause fluctuations in our quarterly results; • the sufficiency of our sources of funding; • our potential exposure in connection with new and pending investigations, proceedings, and other contingencies, including the possibility that certain legal proceedings to which we are a party could harm our business, financial condition, and operating results; 3 Table of Contents Alphabet Inc. • our expectation that we will continue to face heightened regulatory scrutiny, and changes in regulatory conditions, laws, and public policies, which could affect our business practices and financial results; • the expected timing, amount, and effect of Alphabet Inc.'s share repurchases and dividends; • our long-term sustainability goals; • our expectations regarding the timing and successful closing and integration of the Wiz, Inc. (\"Wiz\") acquisition, including the realization of anticipated benefits; and • ongoing developments surrounding international trade and the related impact on the macroeconomic environment and our business; as well as other statements regarding our future operations, financial condition and prospects, and business strategies. Forward-looking statements may appear throughout this report and other documents we file with the Securities and Exchange Commission (SEC), including without limitation, the following sections: Part I, Item 2, \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in this Quarterly Report on Form 10-Q and Part I, Item 1A, “Risk Factors” in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024. Forward-looking statements generally can be identified by words such as \"anticipates,\" \"believes,\" \"could,\" \"estimates,\" \"expects,\" \"intends,\" \"may,\" \"plans,\" \"predicts,\" \"projects,\" \"will be,\" \"will continue,\" \"will likely result,\" and similar expressions. These forward-looking statements are based on current expectations and assumptions that are subject to risks and uncertainties, which could cause our actual results to differ materially from those reflected in the forward-looking statements. Factors that could cause or contribute to such differences include, but are not limited to, those discussed in this Quarterly Report on Form 10-Q; the risks discussed in Part I, Item 1A, \"Risk Factors\" and the trends discussed in Part II, Item 7, \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024; and those discussed in other documents we file with the SEC. We undertake no obligation to revise or publicly release the results of any revision to these forward-looking statements, except as required by law. Given these risks and uncertainties, readers are cautioned not to place undue reliance on such forward-looking statements. As used herein, \"Alphabet,\" \"the company,\" \"we,\" \"us,\" \"our,\" and similar terms include Alphabet Inc. and its subsidiaries, unless the context indicates otherwise. \"Alphabet,\" \"Google,\" and other trademarks of ours appearing in this report are our property. We do not intend our use or display of other companies' trade names or trademarks to imply an endorsement or sponsorship of us by such companies, or any relationship with any of these companies. 4 Table of Contents Alphabet Inc. PART I. FINANCIAL INFORMATION ITEM 1. FINANCIAL STATEMENTS Alphabet Inc. CONSOLIDATED BALANCE SHEETS (in millions, except par value per share amounts) As of December 31, 2024 As of June 30, 2025 (unaudited) Assets Current assets: Cash and cash equivalents $ 23,466 $ 21,036 Marketable securities 72,191 74,112 Total cash, cash equivalents, and marketable securities 95,657 95,148 Accounts receivable, net 52,340 55,048 Other current assets 15,714 16,020 Total current assets 163,711 166,216 Non-marketable securities 37,982 52,574 Deferred income taxes 17,180 19,289 Property and equipment, net 171,036 203,231 Operating lease assets 13,588 14,255 Goodwill 31,885 32,335 Other non-current assets 14,874 14,153 Total assets $ 450,256 $ 502,053 Liabilities and Stockholders’ Equity Current liabilities: Accounts payable $ 7,987 $ 8,347 Accrued compensation and benefits 15,069 12,168 Accrued expenses and other current liabilities 51,228 52,039 Accrued revenue share 9,802 9,787 Deferred revenue 5,036 4,969 Total current liabilities 89,122 87,310 Long-term debt 10,883 23,607 Income taxes payable, non-current 8,782 10,027 Operating lease liabilities 11,691 11,952 Other long-term liabilities 4,694 6,241 Total liabilities 125,172 139,137 Commitments and Contingencies (Note 10) Stockholders’ equity: Preferred stock, $ 0.001 par value per share, 100 shares authorized; no shares issued and outstanding 0 0 Class A, Class B, and Class C stock and additional paid-in capital, $ 0.001 par value per share: 300,000 shares authorized (Class A 180,000 , Class B 60,000 , Class C 60,000 ); 12,211 (Class A 5,835 , Class B 861 , Class C 5,515 ) and 12,104 (Class A 5,816 , Class B 849 , Class C 5,439 ) s hares issued and outstanding 84,800 89,283 Accumulated other comprehensive income (loss) ( 4,800 ) ( 2,127 ) Retained earnings 245,084 275,760 Total stockholders’ equity 325,084 362,916 Total liabilities and stockholders’ equity $ 450,256 $ 502,053 See accompanying notes. 5 Table of Contents Alphabet Inc. Alphabet Inc. CONSOLIDATED STATEMENTS OF INCOME (in millions, except per share amounts; unaudited) Three Months Ended Six Months Ended June 30, June 30, 2024 2025 2024 2025 Revenues $ 84,742 $ 96,428 $ 165,281 $ 186,662 Costs and expenses: Cost of revenues 35,507 39,039 69,219 75,400 Research and development 11,860 13,808 23,763 27,364 Sales and marketing 6,792 7,101 13,218 13,273 General and administrative 3,158 5,209 6,184 8,748 Total costs and expenses 57,317 65,157 112,384 124,785 Income from operations 27,425 31,271 52,897 61,877 Other income (expense), net 126 2,662 2,969 13,845 Income before income taxes 27,551 33,933 55,866 75,722 Provision for income taxes 3,932 5,737 8,585 12,986 Net income $ 23,619 $ 28,196 $ 47,281 $ 62,736 Basic net income per share (Note 12) $ 1.91 $ 2.33 $ 3.82 $ 5.16 Diluted net income per share (Note 12) $ 1.89 $ 2.31 $ 3.78 $ 5.12 See accompanying notes. 6 Table of Contents Alphabet Inc. Alphabet Inc. CONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME (in millions; unaudited) Three Months Ended Six Months Ended June 30, June 30, 2024 2025 2024 2025 Net income $ 23,619 $ 28,196 $ 47,281 $ 62,736 Other comprehensive income (loss): Change in foreign currency translation adjustment, net of income tax benefit (expense) of $( 26 ), $ 190 , $( 44 ), and $ 235 ( 447 ) 2,610 ( 950 ) 3,273 Available-for-sale investments: Change in net unrealized gains (losses) ( 93 ) 191 ( 453 ) 836 Less: reclassification adjustment for net (gains) losses included in net income 230 ( 29 ) 541 ( 113 ) Net change, net of income tax benefit (expens e) of $( 40 ), $( 46 ), $( 26 ), and $( 205 ) 137 162 88 723 Cash flow hedges: Change in net unrealized gains (losses) 232 ( 920 ) 418 ( 1,233 ) Less: reclassification adjustment for net (gains) losses included in net income ( 95 ) 107 ( 166 ) ( 90 ) Net change, net of income tax benefit (expense) of $( 27 ), $ 208 , $( 50 ), and $ 339 137 ( 813 ) 252 ( 1,323 ) Other comprehensive income (loss) ( 173 ) 1,959 ( 610 ) 2,673 Comprehensive income $ 23,446 $ 30,155 $ 46,671 $ 65,409 See accompanying notes. 7 Table of Contents Alphabet Inc. Alphabet Inc. CONSOLIDATED STATEMENTS OF STOCKHOLDERS’ EQUITY (in millions; unaudited) Three Months Ended June 30, 2024 Class A, Class B, Class C Stock and Additional Paid-In Capital Accumulated Other Comprehensive Income (Loss) Retained Earnings Total Stockholders’ Equity Shares Amount Balance as of March 31, 2024 12,381 $ 77,913 $ ( 4,839 ) $ 219,770 $ 292,844 Stock issued 33 0 0 0 0 Stock-based compensation 0 5,908 0 0 5,908 Tax withholding related to vesting of restricted stock units and other 0 ( 3,304 ) 0 0 ( 3,304 ) Repurchases of stock ( 92 ) ( 789 ) 0 ( 14,809 ) ( 15,598 ) Dividends and dividend equivalents declared ($ 0.20 per share) 0 4 0 ( 2,547 ) ( 2,543 ) Net income 0 0 0 23,619 23,619 Other comprehensive income (loss) 0 0 ( 173 ) 0 ( 173 ) Balance as of June 30, 2024 12,322 $ 79,732 $ ( 5,012 ) $ 226,033 $ 300,753 Six Months Ended June 30, 2024 Class A, Class B, Class C Stock and Additional Paid-In Capital Accumulated Other Comprehensive Income (Loss) Retained Earnings Total Stockholders’ Equity Shares Amount Balance as of December 31, 2023 12,460 $ 76,534 $ ( 4,402 ) $ 211,247 $ 283,379 Stock issued 65 0 0 0 0 Stock-based compensation 0 11,201 0 0 11,201 Tax withholding related to vesting of restricted stock units and other 0 ( 6,300 ) 0 0 ( 6,300 ) Repurchases of stock ( 203 ) ( 1,707 ) 0 ( 29,948 ) ( 31,655 ) Dividends and dividend equivalents declared ($ 0.20 per share) 0 4 0 ( 2,547 ) ( 2,543 ) Net income 0 0 0 47,281 47,281 Other comprehensive income (loss) 0 0 ( 610 ) 0 ( 610 ) Balance as of June 30, 2024 12,322 $ 79,732 $ ( 5,012 ) $ 226,033 $ 300,753 8 Table of Contents Alphabet Inc. Three Months Ended June 30, 2025 Class A, Class B, Class C Stock and Additional Paid-In Capital Accumulated Other Comprehensive Income (Loss) Retained Earnings Total Stockholders’ Equity Shares Amount Balance as of March 31, 2025 12,155 $ 86,725 $ ( 4,086 ) $ 262,628 $ 345,267 Stock issued 30 0 0 0 0 Stock-based compensation 0 6,045 0 0 6,045 Tax withholding related to vesting of restricted stock units and other 0 ( 2,709 ) 0 0 ( 2,709 ) Repurchases of stock ( 81 ) ( 811 ) 0 ( 12,452 ) ( 13,263 ) Dividends and dividend equivalents declare d ($ 0.21 per sh are) 0 33 0 ( 2,612 ) ( 2,579 ) Sale of interest in consolidated entities 0 0 0 0 0 Net income 0 0 0 28,196 28,196 Other comprehensive income (loss) 0 0 1,959 0 1,959 Balance as of June 30, 2025 12,104 $ 89,283 $ ( 2,127 ) $ 275,760 $ 362,916 Six Months Ended June 30, 2025 Class A, Class B, Class C Stock and Additional Paid-In Capital Accumulated Other Comprehensive Income (Loss) Retained Earnings Total Stockholders’ Equity Shares Amount Balance as of December 31, 2024 12,211 $ 84,800 $ ( 4,800 ) $ 245,084 $ 325,084 Stock issued 57 0 0 0 0 Stock-based compensation 0 11,598 0 0 11,598 Tax withholding related to vesting of restricted stock units and other 0 ( 5,949 ) 0 0 ( 5,949 ) Repurchases of stock ( 164 ) ( 1,626 ) 0 ( 26,938 ) ( 28,564 ) Dividends and dividend equivalents decla red ($ 0.41 per share) 0 60 0 ( 5,122 ) ( 5,062 ) Sale of interest in consolidated entities 0 400 0 0 400 Net income 0 0 0 62,736 62,736 Other comprehensive income (loss) 0 0 2,673 0 2,673 Balance as of June 30, 2025 12,104 $ 89,283 $ ( 2,127 ) $ 275,760 $ 362,916 See accompanying notes. 9 Table of Contents Alphabet Inc. Alphabet Inc. CONSOLIDATED STATEMENTS OF CASH FLOWS (in millions; unaudited) Six Months Ended June 30, 2024 2025 Operating activities Net income $ 47,281 $ 62,736 Adjustments: Depreciation of property and equipment 7,121 9,485 Stock-based compensation expense 11,129 11,514 Deferred income taxes ( 2,738 ) ( 1,596 ) Loss (gain) on debt and equity securities, net ( 757 ) ( 11,411 ) Other 1,185 1,041 Changes in assets and liabilities, net of effects of acquisitions: Accounts receivable, net 110 ( 1,201 ) Income taxes, net ( 889 ) ( 2,434 ) Other assets ( 1,532 ) ( 2,767 ) Accounts payable ( 563 ) ( 327 ) Accrued expenses and other liabilities ( 5,176 ) ( 1,560 ) Accrued revenue share 97 ( 219 ) Deferred revenue 220 636 Net cash provided by operating activities 55,488 63,897 Investing activities Purchases of property and equipment ( 25,198 ) ( 39,643 ) Purchases of marketable securities ( 43,011 ) ( 39,870 ) Maturities and sales of marketable securities 58,577 40,930 Purchases of non-marketable securities ( 2,199 ) ( 2,312 ) Maturities and sales of non-marketable securities 605 873 Acquisitions, net of cash acquired, and purchases of intangible assets ( 87 ) ( 353 ) Other investing activities ( 32 ) ( 363 ) Net cash used in investing activities ( 11,345 ) ( 40,738 ) Financing activities Net payments related to stock-based award activities ( 6,138 ) ( 5,731 ) Repurchases of stock ( 31,380 ) ( 28,706 ) Dividend payments ( 2,466 ) ( 4,977 ) Proceeds from issuance of debt, net of costs 4,875 31,378 Repayments of debt ( 5,502 ) ( 18,397 ) Proceeds from sale of interest in consolidated entities, net 8 400 Net cash used in financing activities ( 40,603 ) ( 26,033 ) Effect of exchange rate changes on cash and cash equivalents ( 363 ) 444 Net increase (decrease) in cash and cash equivalents 3,177 ( 2,430 ) Cash and cash equivalents at beginning of period 24,048 23,466 Cash and cash equivalents at end of period $ 27,225 $ 21,036 See accompanying notes. 10 Table of Contents Alphabet Inc. Alphabet Inc. NOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Unaudited) Note 1. Summary of Significant Accounting Policies Nature of Operations Google was incorporated in California in September 1998 and re-incorporated in the State of Delaware in August 2003. In 2015, we implemented a holding company reorganization, and as a result, Alphabet Inc. (\"Alphabet\") became the successor issuer to Google. We generate revenues by delivering relevant, cost-effective online advertising; cloud-based solutions that provide enterprise customers of all sizes with infrastructure, platform services, and applications; sales of other products and services, such as fees received for subscription-based products, apps and in-app purchases, and devices. Basis of Consolidation The consolidated financial statements of Alphabet include the accounts of Alphabet and entities consolidated under the variable interest and voting models. Intercompany balances and transactions have been eliminated. Unaudited Interim Financial Information These unaudited interim consolidated financial statements have been prepared in accordance with generally accepted accounting principles in the United States (GAAP), and in our opinion, include all adjustments of a normal recurring nature necessary for fair financial statement presentation. Interim results are not necessarily indicative of the results to be expected for the full year ending December 31, 2025. We have made estimates and assumptions that affect the amounts reported and disclosed in the financial statements and the accompanying notes. Actual results could differ materially from these estimates. These consolidated financial statements and other information presented in this Form 10-Q should be read in conjunction with the consolidated financial statements and the related notes included in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024 filed with the SEC. Recently Issued Accounting Pronouncements Not Yet Adopted In December 2023, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) 2023-09 \"Income Taxes (Topics 740): Improvements to Income Tax Disclosures\" to expand the disclosure requirements for income taxes. Upon adoption, we will be required to disclose additional specified categories in the rate reconciliation in both percentage and dollar amounts. We will also be required to disclose the amount of income taxes paid disaggregated by jurisdiction, among other disclosure requirements. The standard, which is effective for our 2025 annual period, can be applied either prospectively or retrospectively and we are currently assessing which method to adopt. In November 2024, the FASB issued ASU 2024-03 \"Income Statement: Reporting Comprehensive Income-Expense Disaggregation Disclosures (Subtopic 220-40)\" to improve the disclosures about an entity’s expenses. Upon adoption, we will be required to disclose in the notes to the financial statements a disaggregation of certain expense categories included within the expense captions on the face of the income statement. The standard is effective for our 2027 annual period, and our interim periods beginning in 2028, with early adoption permitted. The standard can be applied either prospectively or retrospectively. We are currently assessing adoption timing and the effect that the updated standard will have on our financial statement disclosures. Prior Period Reclassifications Certain amounts in prior periods have been reclassified to conform with current period presentation. 11 Table of Contents Alphabet Inc. Note 2. Revenues Disaggregated Revenues The following table presents revenues disaggregated by type (in millions): Three Months Ended Six Months Ended June 30, June 30, 2024 2025 2024 2025 Google Search & other $ 48,509 $ 54,190 $ 94,665 $ 104,892 YouTube ads 8,663 9,796 16,753 18,723 Google Network 7,444 7,354 14,857 14,610 Google advertising 64,616 71,340 126,275 138,225 Google subscriptions, platforms, and devices 9,312 11,203 18,051 21,582 Google Services total 73,928 82,543 144,326 159,807 Google Cloud 10,347 13,624 19,921 25,884 Other Bets 365 373 860 823 Hedging gains (losses) 102 ( 112 ) 174 148 Total revenues $ 84,742 $ 96,428 $ 165,281 $ 186,662 The following table presents revenues disaggregated by geography, based on the addresses of our customers (in millions): Three Months Ended Six Months Ended June 30, June 30, 2024 2025 2024 2025 United States $ 41,196 49 % $ 46,063 48 % $ 79,933 48 % $ 90,027 48 % EMEA (1) 24,683 29 28,262 29 48,471 29 54,185 29 APAC (1) 13,823 16 16,480 17 27,112 17 31,334 17 Other Americas (1) 4,938 6 5,735 6 9,591 6 10,968 6 Hedging gains (losses) 102 0 ( 112 ) 0 174 0 148 0 Total revenues $ 84,742 100 % $ 96,428 100 % $ 165,281 100 % $ 186,662 100 % (1) Regions represent Europe, the Middle East, and Africa (EMEA); Asia-Pacific (APAC); and Canada and Latin America (\"Other Americas\"). Revenue Backlog As of June 30, 2025, we had $ 108.2 billion of remaining performance obligations (“revenue backlog”), primarily related to Google Cloud. Revenue backlog represents commitm ents in customer contracts for future services that have not yet been recognized as revenue. We expect to r ecognize approximately 55 % of the revenue backlog as revenues over the next 24 months with the remainder to be recognized thereafter. The estimated revenue backlog and timing of revenue recognition for these commitments is largely driven by our ability to deliver in accordance with relevant contract terms and when our customers utilize services. Revenue backlog includes related deferred revenue currently recorded as well as amounts that will be invoiced in future periods, and excludes contracts with an original expected term of one year or less and cancellable contracts. Deferred Revenues We record deferred revenues when cash payments are received or due in advance of our performance, including amounts which are refundable. Deferred revenues primarily relate to Google Cloud and Google s ubscriptions, platforms, and devices. Total deferred revenue as of December 31, 2024 was $ 6.0 billion, of which $ 3.5 billion was recognized as revenues for the six months ended June 30, 2025. Total deferred revenue as of June 30, 2025 was $ 6.8 billion. Note 3. Financial Instruments Fair Value Measurements Investments Measured at Fair Value on a Recurring Basis Cash, cash equivalents, and marketable equity securities are measured at fair value and classified within 12 Table of Contents Alphabet Inc. Level 1 and Level 2 in the fair value hierarchy, because we use quoted prices for identical assets in active markets or inputs that are based upon quoted prices for similar instruments in active markets. Debt securities are measured at fair value and classified within Level 2 in the fair value hierarchy, because we use quoted market prices to the extent available or alternative pricing sources and models utilizing market observable inputs to determine fair value. For certain marketable debt securities, we have elected the fair value option for which changes in fair value are recorded in OI&E. The fair value option was elected for these securities to align with the unrealized gains and losses from related derivative contracts. The following tables summarize our cash, cash equivalents, and marketable securities measured at fair value on a recurring basis (in millions): As of December 31, 2024 Fair Value Hierarchy Adjusted Cost Gross Unrealized Gains Gross Unrealized Losses Fair Value Cash and Cash Equivalents Marketable Securities Fair value changes recorded in other comprehensive income Time deposits Level 2 $ 2,217 $ 0 $ 0 $ 2,217 $ 2,081 $ 136 Government bonds Level 2 27,551 83 ( 214 ) 27,420 50 27,370 Corporate debt securities Level 2 18,300 79 ( 222 ) 18,157 0 18,157 Mortgage-backed and asset-backed securities Level 2 14,437 63 ( 385 ) 14,115 0 14,115 Total investments with fair value change reflected in other comprehensive income (1) 62,505 225 ( 821 ) 61,909 2,131 59,778 Fair value adjustments recorded in net income Money market funds Level 1 8,154 8,154 0 Current marketable equity securities (2) Level 1 4,708 0 4,708 Mutual funds Level 2 105 0 105 Government bonds Level 2 2,035 696 1,339 Corporate debt securities Level 2 3,037 78 2,959 Mortgage-backed and asset-backed securities Level 2 3,302 0 3,302 Total investments with fair value change recorded in net income 21,341 8,928 12,413 Cash 0 12,407 0 Total $ 62,505 $ 225 $ ( 821 ) $ 83,250 $ 23,466 $ 72,191 (1) Represents gross unrealized gains and losses for debt securities recorded to accumulated other comprehensive income (AOCI). (2) The long-term portion of marketable equity securities (subject t"
}